# EDA - CUSTOMER SEGMENTATION DATASET

About the dataset:

Link: https://www.kaggle.com/datasets/muhammadhussnain09/customer-behaviour-dataset/data

Info: This dataset contains 350 customer records with a mix of numerical and categorical features. It includes demographics, spending behavior, and product preferences, making it suitable for unsupervised learning and customer segmentation tasks.

## Libraries and data

In [2]:
# Libraries

import pandas as pd

In [3]:
# Data

PATH_FILE = "/home/gustavo/repos/pandas_specialization/data/customer_segmentation_mixed.csv"
dataset = pd.read_csv(PATH_FILE)

## Inspecting dataset

In [5]:
dataset.head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
0,56,26102,85,6,Female,Clothing
1,46,70336,75,18,Male,Home
2,32,105314,36,10,Male,Groceries

In [6]:
dataset.tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
347,50,42700,77,19,Male,Clothing
348,38,54620,3,6,Female,Electronics
349,49,40559,33,2,Male,Clothing

In [8]:
dataset.info()

<class 'pandas.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                350 non-null    int64
 1   Annual_Income      350 non-null    int64
 2   Spending_Score     350 non-null    int64
 3   Monthly_Visits     350 non-null    int64
 4   Gender             350 non-null    str
 5   Preferred_Product  350 non-null    str
dtypes: int64(4), str(2)
memory usage: 16.5 KB

In [9]:
dataset.shape

(350, 6)

## Sorting for insights

In [ ]:
# Visualización organizando la columna 'Age'

dataset.sort_values("Age").head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
252,18,84895,15,5,Male,Home
265,18,47192,13,19,Male,Sports
134,18,114758,51,9,Female,Electronics

In [ ]:
# Visualización organizando las columnas 'Age' y 'Annual_Income', en forma descendente y acendente

dataset.sort_values(["Age", "Annual_Income"], ascending=[False, True]).head(5)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
326,64,23709,26,17,Male,Groceries
51,64,70300,35,19,Female,Sports
55,64,76661,47,1,Male,Electronics
34,64,90316,60,9,Male,Sports
84,64,93847,92,10,Male,Electronics

In [ ]:
# Visualización organizando la columna 'Age', y mostrando las últimas tres filas

dataset.sort_values("Age").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
51,64,70300,35,19,Female,Sports
55,64,76661,47,1,Male,Electronics
34,64,90316,60,9,Male,Sports

In [ ]:
# Visualización organizando la columna "Annual_Income" y mostrando las tres primeras filas

dataset.sort_values("Annual_Income").head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
202,20,20412,21,7,Male,Groceries
236,20,20728,90,7,Male,Groceries
266,29,21062,84,17,Female,Clothing

In [ ]:
# Visualización organizando la columna "Annual_Income" y mostrando las tres últimas filas

dataset.sort_values("Annual_Income").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
339,52,119518,47,10,Female,Clothing
18,41,119713,57,3,Male,Sports
340,58,119835,1,7,Male,Clothing

In [ ]:
# Visualización organizando las columnas "Monthly_Visits" y "Spending_Score", en forma ascendente y descendente, y finalmente mostrando las 10 primeras filas

dataset.sort_values(["Monthly_Visits", "Spending_Score"], ascending=[True, False]).head(10)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
79,57,114476,99,1,Female,Clothing
140,26,43049,98,1,Male,Sports
336,46,100219,97,1,Female,Sports
87,42,48251,95,1,Male,Clothing
220,21,79031,94,1,Female,Sports
189,54,108668,93,1,Female,Clothing
53,61,75609,82,1,Male,Groceries
57,31,90313,66,1,Female,Home
120,41,113468,65,1,Male,Home
320,44,35485,62,1,Female,Groceries

In [ ]:
# Visualización organizada de la columna "Monthly_Visits", mostrando las tres últimas filas

dataset.sort_values("Monthly_Visits").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
40,26,111083,27,19,Female,Sports
323,47,24748,79,19,Female,Sports
347,50,42700,77,19,Male,Clothing

## Select columns

In [26]:
Age_Gender_Product = dataset[["Age", "Gender", "Preferred_Product"]]
Age_Gender_Product.head(5)

   Age  Gender Preferred_Product
0   56  Female          Clothing
1   46    Male              Home
2   32    Male         Groceries
3   60  Female       Electronics
4   25    Male       Electronics

## Subsetting rows

In [ ]:
# Visualización de las filas de "Annual_Income" con valores menores a 25000. Organizadas por la misma columan de forma ascendente

dataset[dataset['Annual_Income']<25000].sort_values("Annual_Income", ascending=True)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
202,20,20412,21,7,Male,Groceries
236,20,20728,90,7,Male,Groceries
266,29,21062,84,17,Female,Clothing
94,42,21150,74,8,Female,Home
308,34,21324,24,19,Female,Home
286,52,21542,59,6,Female,Sports
35,61,22368,50,5,Female,Sports
65,21,23051,96,19,Female,Electronics
196,49,23267,5,18,Female,Sports
106,52,23343,62,5,Female,Electronics
181,30,23373,4,19,Female,Groceries
326,64,23709,26,17,Male,Groceries
170,61,24000,66,18,Male,Sports
11,41,24014,15,5,Male,Clothing
153,56,24611,30,9,Female,Clothing
323,47,24748,79,19,Female,Sports

In [37]:
dataset[(dataset["Age"]<20) & (dataset["Gender"] == "Male")]

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
22,19,98069,96,18,Male,Sports
62,19,112772,33,8,Male,Groceries
93,18,71990,37,15,Male,Home
98,18,114841,85,12,Male,Groceries
164,19,38071,84,19,Male,Electronics
206,19,109084,12,19,Male,Groceries
212,18,67295,90,8,Male,Electronics
252,18,84895,15,5,Male,Home
264,19,86703,17,18,Male,Electronics
265,18,47192,13,19,Male,Sports
294,19,39065,4,8,Male,Home

In [44]:
home = dataset["Preferred_Product"] == "Home"
visits = dataset["Monthly_Visits"] > 5
fem = dataset["Gender"] == "Female"

dataset[(home)&(visits)&(fem)].sort_values(["Monthly_Visits", "Annual_Income"])

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
17,19,30729,87,6,Female,Home
293,35,108858,70,6,Female,Home
69,61,74021,26,7,Female,Home
94,42,21150,74,8,Female,Home
118,50,92789,50,8,Female,Home
268,54,109780,68,9,Female,Home
257,48,28335,39,12,Female,Home
345,48,87641,37,12,Female,Home
296,33,108092,75,12,Female,Home
99,61,36896,78,13,Female,Home
41,56,107922,63,14,Female,Home
192,61,96797,61,15,Female,Home
16,39,102074,16,15,Female,Home
242,36,36779,26,18,Female,Home
343,46,53591,64,18,Female,Home
193,41,85953,51,18,Female,Home
308,34,21324,24,19,Female,Home
101,41,27805,1,19,Female,Home

In [45]:
dataset["Preferred_Product"].value_counts()

Preferred_Product
Sports         83
Clothing       72
Home           67
Electronics    67
Groceries      61
Name: count, dtype: int64

In [69]:
product = ["Groceries", "Home"]
female = ["Female"]
score = dataset["Spending_Score"] > 50


dataset[(dataset["Preferred_Product"].isin(product)) & (dataset["Gender"].isin(female)) & score].sort_values("Preferred_Product")

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
177,56,109643,95,17,Female,Groceries
320,44,35485,62,1,Female,Groceries
63,23,100135,65,19,Female,Groceries
71,27,78335,89,8,Female,Groceries
76,25,59734,77,7,Female,Groceries
276,37,94460,83,4,Female,Groceries
104,25,65543,77,4,Female,Groceries
123,61,74340,94,11,Female,Groceries
130,54,49124,85,5,Female,Groceries
171,61,90588,77,17,Female,Groceries
203,54,27543,70,3,Female,Groceries
296,33,108092,75,12,Female,Home
293,35,108858,70,6,Female,Home
268,54,109780,68,9,Female,Home
229,28,63286,99,4,Female,Home
17,19,30729,87,6,Female,Home
193,41,85953,51,18,Female,Home
192,61,96797,61,15,Female,Home
324,50,106769,75,3,Female,Home
99,61,36896,78,13,Female,Home
94,42,21150,74,8,Female,Home
57,31,90313,66,1,Female,Home
41,56,107922,63,14,Female,Home
200,56,46092,61,1,Female,Home
343,46,53591,64,18,Female,Home